CSI API ETABS v1
cPropLink.GetTypeOAPI Method
 Retrieves the property type for the specified link property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeOAPI(
	string Name,
	ref eLinkPropType PropType
)
Function GetTypeOAPI (
	Name As String,
	ByRef PropType As eLinkPropType
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim PropType As eLinkPropType
Dim returnValue As Integer
returnValue = instance.GetTypeOAPI(Name,
	PropType)
int GetTypeOAPI(
	String^ Name,
	eLinkPropType% PropType
)
abstract GetTypeOAPI :
        Name : string *
        PropType : eLinkPropType byref -> int
Parameters
Name
Type: System.String
The name of an existing link property.
PropType
Type: ETABSv1.eLinkPropType
This is one of the items in the eLinkPropType enumeration.
Return Value
Type: Int32
Returns zero if the type is successfully retrieved; otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DOF() As Boolean
       Dim Fixed() As Boolean
       Dim Ke() As Double
       Dim Ce() As Double
       Dim PropType As eLinkPropType
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link property
       ReDim DOF(5)
       ReDim Fixed(5)
       ReDim Ke(5)
       ReDim Ce(5)
       DOF(0) = True
       Ke(0) = 12
       ret = SapModel.PropLink.SetLinear("L1", DOF, Fixed, Ke, Ce, 0, 0)
   'get link property type
       ret = SapModel.PropLink.GetTypeOAPI("L1", PropType)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropLink Interface
ETABSv1 Namespace